In [22]:
import pandas as pd
import numpy as np
data = pd.read_csv('aind2-dl/student_data.csv', nrows=30)
print(data)

    admit  gre   gpa  rank
0       0  380  3.61     3
1       1  660  3.67     3
2       1  800  4.00     1
3       1  640  3.19     4
4       0  520  2.93     4
5       1  760  3.00     2
6       1  560  2.98     1
7       0  400  3.08     2
8       1  540  3.39     3
9       0  700  3.92     2
10      0  800  4.00     4
11      0  440  3.22     1
12      1  760  4.00     1
13      0  700  3.08     2
14      1  700  4.00     1
15      0  480  3.44     3
16      0  780  3.87     4
17      0  360  2.56     3
18      0  800  3.75     2
19      1  540  3.81     1
20      0  500  3.17     3
21      1  660  3.63     2
22      0  600  2.82     4
23      0  680  3.19     4
24      1  760  3.35     2
25      1  800  3.66     1
26      1  620  3.61     1
27      1  520  3.74     4
28      1  780  3.22     2
29      0  520  3.29     1

In [20]:
#get_dummies converts categorical variable into dummy variables (used for one-hot encoding)
onehot_encoded_data = pd.get_dummies(data, columns=['rank'])
onehot_encoded_data

    admit  gre   gpa  rank_1  rank_2  rank_3  rank_4
0       0  380  3.61       0       0       1       0
1       1  660  3.67       0       0       1       0
2       1  800  4.00       1       0       0       0
3       1  640  3.19       0       0       0       1
4       0  520  2.93       0       0       0       1
5       1  760  3.00       0       1       0       0
6       1  560  2.98       1       0       0       0
7       0  400  3.08       0       1       0       0
8       1  540  3.39       0       0       1       0
9       0  700  3.92       0       1       0       0
10      0  800  4.00       0       0       0       1
11      0  440  3.22       1       0       0       0
12      1  760  4.00       1       0       0       0
13      0  700  3.08       0       1       0       0
14      1  700  4.00       1       0       0       0
15      0  480  3.44       0       0       1       0
16      0  780  3.87       0       0       0       1
17      0  360  2.56       0       0       1       0
18      0  800  3.75       0       1       0       0
19      1  540  3.81       1       0       0       0
20      0  500  3.17       0       0       1       0
21      1  660  3.63       0       1       0       0
22      0  600  2.82       0       0       0       1
23      0  680  3.19       0       0       0       1
24      1  760  3.35       0       1       0       0
25      1  800  3.66       1       0       0       0
26      1  620  3.61       1       0       0       0
27      1  520  3.74       0       0       0       1
28      1  780  3.22       0       1       0       0
29      0  520  3.29       1       0       0       0

In [33]:
X = np.array(onehot_encoded_data)[:,1:]
X

array([[ 380.  ,    3.61,    0.  ,    0.  ,    1.  ,    0.  ],
       [ 660.  ,    3.67,    0.  ,    0.  ,    1.  ,    0.  ],
       [ 800.  ,    4.  ,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 640.  ,    3.19,    0.  ,    0.  ,    0.  ,    1.  ],
       [ 520.  ,    2.93,    0.  ,    0.  ,    0.  ,    1.  ],
       [ 760.  ,    3.  ,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 560.  ,    2.98,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 400.  ,    3.08,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 540.  ,    3.39,    0.  ,    0.  ,    1.  ,    0.  ],
       [ 700.  ,    3.92,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 800.  ,    4.  ,    0.  ,    0.  ,    0.  ,    1.  ],
       [ 440.  ,    3.22,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 760.  ,    4.  ,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 700.  ,    3.08,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 700.  ,    4.  ,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 480.  ,    3.44,    0.  ,    0.  ,    1.  ,    0.  ],
       [ 780.  ,    3.87,    0.  ,    0.  ,    0.  ,    1.  ],
       [ 360.  ,    2.56,    0.  ,    0.  ,    1.  ,    0.  ],
       [ 800.  ,    3.75,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 540.  ,    3.81,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 500.  ,    3.17,    0.  ,    0.  ,    1.  ,    0.  ],
       [ 660.  ,    3.63,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 600.  ,    2.82,    0.  ,    0.  ,    0.  ,    1.  ],
       [ 680.  ,    3.19,    0.  ,    0.  ,    0.  ,    1.  ],
       [ 760.  ,    3.35,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 800.  ,    3.66,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 620.  ,    3.61,    1.  ,    0.  ,    0.  ,    0.  ],
       [ 520.  ,    3.74,    0.  ,    0.  ,    0.  ,    1.  ],
       [ 780.  ,    3.22,    0.  ,    1.  ,    0.  ,    0.  ],
       [ 520.  ,    3.29,    1.  ,    0.  ,    0.  ,    0.  ]])

#### stripping off n char from dataframe series

In [1]:
import pandas as pd
import numpy as np
s = pd.Series(['1. Ant.  ', '2. Bee!\n', '3. Cat?\t', np.nan])
s
'''
0    1. Ant.  
1    2. Bee!\n
2    3. Cat?\t
3          NaN
dtype: object
'''
s.str.lstrip('123.')
'''
0     Ant.  
1     Bee!\n
2     Cat?\t
3        NaN
dtype: object

'''
s.str.rstrip('.!? \n\t')
'''

0    1. Ant
1    2. Bee
2    3. Cat
3       NaN
dtype: object
'''

0    1. Ant.
1    2. Bee!\n
2    3. Cat?\t
3          NaN
dtype: object

#### splitting a column by delimiter

In [ ]:
#Split and store the column data in multiple columns
data[['Add1', 'Add2']] = data['OwnerCSZ'].str.split(',', expand = True)

#For accessing just one of the many splits: 
data['Zip2'] = data['Add2'].str.split(' ').str[2]

#### Conditional expression for EACH row in dataframe column

#### Multiple conditions:

In [ ]:
#EACH row:
df[df['column name'].map(len) < 2]

# Multiple conditions:
df = df.drop(df[(df.score < 50) & (df.score > 20)].index)

#### select values by partial string match ---> Contains

In [ ]:
df[df['A'].str.contains("hello")] # this might throw an error if column 'A' has null/NaN values
#To avoid that, use:
df[df['A'].str.contains("Hello|Britain")==True] # reg expression can also be used within 'contains'

### Indexing, Slicing and Subsetting DataFrames in Python

http://chris.friedline.net/2015-12-15-rutgers/lessons/python2/02-index-slice-subset.html

### Accessing index number or convert Int64Index to int

In [ ]:
#.index --> returns a list even though it has only one element, hence to access that element:
t1 = temp[temp['col1'] == 'Tenant Name (Company)'].index[0]

### counting non-NONE values across columns

In [ ]:
pax['count'] = pax[pax!= 'None'].count(axis=1)
#any condition can be used, eg. value> 4, value='specificval' etc

### iterating throu dataframe rows

In [ ]:
for row in pax.itertuples():
    print(row)
    print(getattr(row,'time'))
    break
    
'''
Pandas(Index=0, time='Morning', zones="['A1' 'A2']", paxvol=203.13101066124, z1='A1', z2='A2', z3=None, z4=None, z5=None, zn=2, zvol=101.56550533062)
Morning

'''

### filtering columns with NaN values

In [ ]:
pz[pz['zones'].isnull()] #filtering basis 'zones' column

#can also do: 
pd.isnull(pz).any(axis=1) # filter on whole dataframe

## Dealing with Duplicates

In [3]:
test1 = pd.DataFrame({'col1':['a', 'b', 'c'], 'col2': ['x', 'y', 'z']})
test2 = pd.DataFrame({'col1':['c', 'b', 'd'], 'col2': ['l', 'y', 'n']})

In [4]:
test1 = test1.append(test2)
test1

  col1 col2
0    a    x
1    b    y
2    c    z
0    c    l
1    b    y
2    d    n

In [5]:
'''
drop_duplicates()
parameters: 
    subset (default: all columns)
    keep: first, last, False (default: first occurence, False means drop all)
    inplace (default: False)
'''
test1.drop_duplicates()

  col1 col2
0    a    x
1    b    y
2    c    z
0    c    l
2    d    n

In [2]:
import pandas as pd

#### Flatout list of lists into single list/set

In [5]:
import itertools
list2d = [[1,2,3],[4,5,6], [7], [8,9]]
merged = list(itertools.chain(*list2d))

## CRASH COURSE  - _pandas_

In [1]:
import pandas as pd
import numpy as np

df_can = pd.read_excel('https://ibm.box.com/shared/static/lw190pt9zpy5bd1ptyg2aw15awomz9pu.xlsx', 
                       sheet_name='Canada by Citizenship',
                       skiprows=range(20),
                       skipfooter=2)
df_can.head() #first 5 rows

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1,...,1450,1223,856,702,560,716,561,539,620,603
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0,...,0,0,1,1,0,0,0,0,1,1

In [2]:
df_can.tail() #last 5 rows

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
190,Immigrants,Foreigners,Viet Nam,935,Asia,920,South-Eastern Asia,902,Developing regions,1191,...,1816,1852,3153,2574,1784,2171,1942,1723,1731,2112
191,Immigrants,Foreigners,Western Sahara,903,Africa,912,Northern Africa,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
192,Immigrants,Foreigners,Yemen,935,Asia,922,Western Asia,902,Developing regions,1,...,124,161,140,122,133,128,211,160,174,217
193,Immigrants,Foreigners,Zambia,903,Africa,910,Eastern Africa,902,Developing regions,11,...,56,91,77,71,64,60,102,69,46,59
194,Immigrants,Foreigners,Zimbabwe,903,Africa,910,Eastern Africa,902,Developing regions,72,...,1450,615,454,663,611,508,494,434,437,407

### BASIC INFO of dataframe

In [3]:
#basic info about the dataframe
df_can.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 43 columns):
Type        195 non-null object
Coverage    195 non-null object
OdName      195 non-null object
AREA        195 non-null int64
AreaName    195 non-null object
REG         195 non-null int64
RegName     195 non-null object
DEV         195 non-null int64
DevName     195 non-null object
1980        195 non-null int64
1981        195 non-null int64
1982        195 non-null int64
1983        195 non-null int64
1984        195 non-null int64
1985        195 non-null int64
1986        195 non-null int64
1987        195 non-null int64
1988        195 non-null int64
1989        195 non-null int64
1990        195 non-null int64
1991        195 non-null int64
1992        195 non-null int64
1993        195 non-null int64
1994        195 non-null int64
1995        195 non-null int64
1996        195 non-null int64
1997        195 non-null int64
1998        195 non-null int64
1999        195 non-null int64
2000        195 non-null int64
2001        195 non-null int64
2002        195 non-null int64
2003        195 non-null int64
2004        195 non-null int64
2005        195 non-null int64
2006        195 non-null int64
2007        195 non-null int64
2008        195 non-null int64
2009        195 non-null int64
2010        195 non-null int64
2011        195 non-null int64
2012        195 non-null int64
2013        195 non-null int64
dtypes: int64(37), object(6)
memory usage: 65.6+ KB

In [5]:
df_can.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [9]:
df_can.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155,
       156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168,
       169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181,
       182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194],
      dtype=int64)

The default type of index and columns is NOT list

In [10]:
print(type(df_can.columns))
print(type(df_can.index))

<class 'pandas.core.indexes.base.Index'>
<class 'pandas.core.indexes.range.RangeIndex'>

In [11]:
df_can.columns.tolist()
df_can.index.tolist()

print (type(df_can.columns.tolist()))
print (type(df_can.index.tolist()))

<class 'list'>
<class 'list'>

In [12]:
#size of the dataframe
df_can.shape

(195, 43)

### in pandas axis=0 represents rows (default) and axis=1 represents columns.

### REMOVE unnecessary columns

In [13]:
df_can.drop(['AREA','REG','DEV','Type','Coverage'], axis =1, inplace = True)
df_can.head()

,OdName,AreaName,RegName,DevName,1980,1981,1982,1983,1984,1985,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,Asia,Southern Asia,Developing regions,16,39,39,47,71,340,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Albania,Europe,Southern Europe,Developed regions,1,0,0,0,0,0,...,1450,1223,856,702,560,716,561,539,620,603
2,Algeria,Africa,Northern Africa,Developing regions,80,67,71,69,63,44,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,American Samoa,Oceania,Polynesia,Developing regions,0,1,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4,Andorra,Europe,Southern Europe,Developed regions,0,0,0,0,0,0,...,0,0,1,1,0,0,0,0,1,1

### RENAME columns

In [14]:
df_can.rename(columns = {'OdName': 'Country', 'AreaName':'Continent', 'RegName': 'Region'}, inplace = True)
df_can.columns

Index([  'Country', 'Continent',    'Region',   'DevName',        1980,
              1981,        1982,        1983,        1984,        1985,
              1986,        1987,        1988,        1989,        1990,
              1991,        1992,        1993,        1994,        1995,
              1996,        1997,        1998,        1999,        2000,
              2001,        2002,        2003,        2004,        2005,
              2006,        2007,        2008,        2009,        2010,
              2011,        2012,        2013],
      dtype='object')

In [15]:
# adding a 'Total' column that sums up the total immigrants by country over the entire period 1980 - 2013
df_can['Total'] = df_can.sum(axis =1)
df_can.head(2)

,Country,Continent,Region,DevName,1980,1981,1982,1983,1984,1985,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
0,Afghanistan,Asia,Southern Asia,Developing regions,16,39,39,47,71,340,...,3436,3009,2652,2111,1746,1758,2203,2635,2004,58639
1,Albania,Europe,Southern Europe,Developed regions,1,0,0,0,0,0,...,1223,856,702,560,716,561,539,620,603,15699

### check how many NULL objects

In [17]:
df_can.isnull().sum()

Country      0
Continent    0
Region       0
DevName      0
1980         0
1981         0
1982         0
1983         0
1984         0
1985         0
1986         0
1987         0
1988         0
1989         0
1990         0
1991         0
1992         0
1993         0
1994         0
1995         0
1996         0
1997         0
1998         0
1999         0
2000         0
2001         0
2002         0
2003         0
2004         0
2005         0
2006         0
2007         0
2008         0
2009         0
2010         0
2011         0
2012         0
2013         0
Total        0
dtype: int64

### SUMMARY of dataframe

In [19]:
df_can.describe()

,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
count,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,...,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000
mean,508.394872,566.989744,534.723077,387.435897,376.497436,358.861538,441.271795,691.133333,714.389744,843.241026,...,1320.292308,1266.958974,1191.820513,1246.394872,1275.733333,1420.287179,1262.533333,1313.958974,1320.702564,32867.451282
std,1949.588546,2152.643752,1866.997511,1204.333597,1198.246371,1079.309600,1225.576630,2109.205607,2443.606788,2555.048874,...,4425.957828,3926.717747,3443.542409,3694.573544,3829.630424,4462.946328,4030.084313,4247.555161,4237.951988,91785.498686
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.500000,0.500000,1.000000,1.000000,...,28.500000,25.000000,31.000000,31.000000,36.000000,40.500000,37.500000,42.500000,45.000000,952.000000
50%,13.000000,10.000000,11.000000,12.000000,13.000000,17.000000,18.000000,26.000000,34.000000,44.000000,...,210.000000,218.000000,198.000000,205.000000,214.000000,211.000000,179.000000,233.000000,213.000000,5018.000000
75%,251.500000,295.500000,275.000000,173.000000,181.000000,197.000000,254.000000,434.000000,409.000000,508.500000,...,832.000000,842.000000,899.000000,934.500000,888.000000,932.000000,772.000000,783.000000,796.000000,22239.500000
max,22045.000000,24796.000000,20620.000000,10015.000000,10170.000000,9564.000000,9470.000000,21337.000000,27359.000000,23795.000000,...,42584.000000,33848.000000,28742.000000,30037.000000,29622.000000,38617.000000,36765.000000,34315.000000,34129.000000,691904.000000